doc/ch02-derivatives/04-mat.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-11-29 Sun 00:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Sec2.4 Derivatives of Mat/Vec/Scalar</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wan-Duo Kurt Ma Wan-Duo Kurt Ma" />
<link rel='stylesheet' type='text/css' href='https://web.stanford.edu/~ksb/css/esquemadorg.css'></link>
</head>
<body>
<div id="content">
<h1 class="title">Sec2.4 Derivatives of Mat/Vec/Scalar</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga0d542a">1. Eq69</a>
<ul>
<li><a href="#orgf6a4fda">1.1. problem</a></li>
<li><a href="#orgad20cb5">1.2. derivation</a></li>
</ul>
</li>
<li><a href="#org7a47696">2. Eq70</a>
<ul>
<li><a href="#org1e27a10">2.1. problem</a></li>
<li><a href="#org32bf412">2.2. derivation</a></li>
</ul>
</li>
<li><a href="#org7d5fdee">3. Eq71</a>
<ul>
<li><a href="#orgb7f4ef6">3.1. problem</a></li>
<li><a href="#org99dab88">3.2. derivation</a></li>
</ul>
</li>
<li><a href="#org758fadc">4. Eq72</a>
<ul>
<li><a href="#org325c4c9">4.1. problem</a></li>
<li><a href="#org9cba3c0">4.2. derivation</a></li>
</ul>
</li>
<li><a href="#org1cbd9e2">5. Eq73</a>
<ul>
<li><a href="#orgd155eec">5.1. problem</a></li>
<li><a href="#org541d3d3">5.2. derivation</a></li>
</ul>
</li>
<li><a href="#orgd4ca7ff">6. Eq74</a>
<ul>
<li><a href="#org298a968">6.1. problem</a></li>
<li><a href="#org0ec7eda">6.2. derivation</a></li>
</ul>
</li>
<li><a href="#org3c69352">7. Eq75</a>
<ul>
<li><a href="#org41d3019">7.1. problem</a></li>
<li><a href="#org5b41ecf">7.2. derivation</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orga0d542a" class="outline-2">
<h2 id="orga0d542a"><span class="section-number-2">1</span> Eq69</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgf6a4fda" class="outline-3">
<h3 id="orgf6a4fda"><span class="section-number-3">1.1</span> problem</h3>
<div class="outline-text-3" id="text-1-1">
<div class="LaTeX">
\begin{equation}
\begin{split}
  \frac{\partial }{\partial \mathbf{x}} \big(\mathbf{x}^T \mathbf{a}\big)
  = \frac{\partial }{\partial \mathbf{x}} \big(\mathbf{a}^T \mathbf{x}\big)
  = \mathbf{a}
\end{split}
\end{equation}

</div>
</div>
</div>

<div id="outline-container-orgad20cb5" class="outline-3">
<h3 id="orgad20cb5"><span class="section-number-3">1.2</span> derivation</h3>
<div class="outline-text-3" id="text-1-2">
<div class="LaTeX">
\begin{equation}
\begin{split}
  \frac{\partial }{\partial \mathbf{x}} \big(\mathbf{x}^T \mathbf{a}\big)
  &= \big[... ,\frac{\partial }{\partial x_j} \sum_k x_ka_k, ... \big]^T \\
  &= \big[... , a_j, ... \big]^T \\
  &= \mathbf{a}
\end{split}
\end{equation}

</div>
</div>
</div>
</div>

<div id="outline-container-org7a47696" class="outline-2">
<h2 id="org7a47696"><span class="section-number-2">2</span> Eq70</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org1e27a10" class="outline-3">
<h3 id="org1e27a10"><span class="section-number-3">2.1</span> problem</h3>
<div class="outline-text-3" id="text-2-1">
<div class="LaTeX">
\begin{equation}
\begin{split}
\frac{\partial }{\partial \mathbf{X}} \big(\mathbf{a}^T\mathbf{X}\mathbf{b}\big) = \mathbf{a}\mathbf{b}^T
\end{split}
\end{equation}

</div>
</div>
</div>

<div id="outline-container-org32bf412" class="outline-3">
<h3 id="org32bf412"><span class="section-number-3">2.2</span> derivation</h3>
<div class="outline-text-3" id="text-2-2">
<div class="LaTeX">
\begin{equation}
\begin{split}
  \frac{\partial }{\partial X_{ij}} \big(\mathbf{a}^T\mathbf{X}\mathbf{b}\big)
  &= \frac{\partial }{\partial X_{ij}} \big( \sum_k \mathbf{a}^T \mathbf{x}_k b_k \big) \\
  &= \frac{\partial }{\partial X_{ij}} \big( \mathbf{a}^T \mathbf{x}_j b_j \big) \quad \text{Those k!=j terms are zero.}\\
  &= \frac{\partial }{\partial X_{ij}} \big( \sum_q a_q X_{qj} b_j \big) \\
  &= \frac{\partial }{\partial X_{ij}} \big( a_i X_{ij} b_j \big) \quad \text{Those q!=i terms are zero.}\\ \\
  &= a_i b_j \\
\end{split}
\end{equation}

</div>

<p>
To stack all the derivative with respect to \(X_{ij}\) then you'll get the answer.
</p>
</div>
</div>
</div>

<div id="outline-container-org7d5fdee" class="outline-2">
<h2 id="org7d5fdee"><span class="section-number-2">3</span> Eq71</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgb7f4ef6" class="outline-3">
<h3 id="orgb7f4ef6"><span class="section-number-3">3.1</span> problem</h3>
<div class="outline-text-3" id="text-3-1">
<div class="LaTeX">
\begin{equation}
\begin{split}
\frac{\partial }{\partial \mathbf{X}} \big(\mathbf{a}^T\mathbf{X}^T\mathbf{b}\big) = \mathbf{a}\mathbf{b}^T
\end{split}
\end{equation}

</div>
</div>
</div>

<div id="outline-container-org99dab88" class="outline-3">
<h3 id="org99dab88"><span class="section-number-3">3.2</span> derivation</h3>
<div class="outline-text-3" id="text-3-2">
<div class="LaTeX">
\begin{equation}
\begin{split}
  \frac{\partial }{\partial X_{ij}} \big(\mathbf{a}^T\mathbf{X}^T\mathbf{b}\big)
  &= \frac{\partial }{\partial X_{ij}} \big( (\mathbf{X}\mathbf{a})^T \mathbf{b} \big) \\
  &= \frac{\partial }{\partial X_{ij}} \big( \sum_k (\mathbf{x}_k a_k)^T \mathbf{b} \big) \\
  &= \frac{\partial }{\partial X_{ij}} \big( \sum_k (a_k \mathbf{x}_k^T)  \mathbf{b} \big) \quad \text{rearange..}\\
  &= \frac{\partial }{\partial X_{ij}} \big( a_j \mathbf{x}_j^T  \mathbf{b} \big) \quad \text{Those k!=j are zeros}\\
  &= \frac{\partial }{\partial X_{ij}} \big( a_j \sum_q (X_{qj} b_q) \big) \\
  &= \frac{\partial }{\partial X_{ij}} \big( a_j X_{ij} b_i \big) \quad \text{Those q!=i are zeros}\\
  &= a_j b_i
\end{split}
\end{equation}

</div>

<p>
which is the transpose of Eq70
</p>
</div>
</div>
</div>

<div id="outline-container-org758fadc" class="outline-2">
<h2 id="org758fadc"><span class="section-number-2">4</span> Eq72</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org325c4c9" class="outline-3">
<h3 id="org325c4c9"><span class="section-number-3">4.1</span> problem</h3>
<div class="outline-text-3" id="text-4-1">
<div class="LaTeX">
\begin{equation}
\begin{split}
\frac{\partial }{\partial \mathbf{X}} \big(\mathbf{a}^T\mathbf{X}\mathbf{a}\big) 
&= \frac{\partial }{\partial \mathbf{X}} \big(\mathbf{a}^T\mathbf{X}^T\mathbf{a}\big) \\
&= \mathbf{a}\mathbf{a}^T
\end{split}
\end{equation}

</div>
</div>
</div>

<div id="outline-container-org9cba3c0" class="outline-3">
<h3 id="org9cba3c0"><span class="section-number-3">4.2</span> derivation</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Simply replace vector \(\mathbf{b}\) in Eq70, Eq71 then you'll get the answer.
</p>
</div>
</div>
</div>

<div id="outline-container-org1cbd9e2" class="outline-2">
<h2 id="org1cbd9e2"><span class="section-number-2">5</span> Eq73</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgd155eec" class="outline-3">
<h3 id="orgd155eec"><span class="section-number-3">5.1</span> problem</h3>
<div class="outline-text-3" id="text-5-1">
<div class="LaTeX">
\begin{equation}
\begin{split}
\frac{\partial }{\partial X_{ij}} \big(\mathbf{X}\big) = \mathbf{J}^{ij}
\end{split}
\end{equation}

</div>

<p>
As pointed in the notation in matrixcook, \(\mathbf{J}^{ij}\) is the matrix basis
which entries are all zero but entry ij is one.
</p>
</div>
</div>

<div id="outline-container-org541d3d3" class="outline-3">
<h3 id="org541d3d3"><span class="section-number-3">5.2</span> derivation</h3>
</div>
</div>

<div id="outline-container-orgd4ca7ff" class="outline-2">
<h2 id="orgd4ca7ff"><span class="section-number-2">6</span> Eq74</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org298a968" class="outline-3">
<h3 id="org298a968"><span class="section-number-3">6.1</span> problem</h3>
<div class="outline-text-3" id="text-6-1">
<div class="LaTeX">
\begin{equation}
\begin{split}
  \frac{\partial }{\partial X_{mn}} \big((\mathbf{X}\mathbf{A})_{ij}\big)
  = \delta_{im}(\mathbf{A})_{nj}
  = (\mathbf{J}^{mn}\mathbf{A})_{ij}
\end{split}
\end{equation}

</div>
</div>
</div>

<div id="outline-container-org0ec7eda" class="outline-3">
<h3 id="org0ec7eda"><span class="section-number-3">6.2</span> derivation</h3>
<div class="outline-text-3" id="text-6-2">
<div class="LaTeX">
\begin{equation}
\begin{split}
(\mathbf{X}\mathbf{A})_{ij} = \sum_k X_{ik} A_{kj}
\end{split}
\end{equation}

</div>


<p>
\(\delta_{im} = 1 \iff i=m\) which means
</p>

<div class="LaTeX">
\begin{equation}
\begin{split}
  \delta_{im}(\mathbf{A})_{nj} = 
  \left\{\begin{matrix}
   \frac{\partial }{\partial X_{in}} \big(\sum_k X_{ik}A_{kj}\big) = A_{nj}& \quad \text{,if} \ m=i\\ 
   0 & \quad \text{,if} \ m \neq i
  \end{matrix}\right.
\end{split}
\end{equation}

</div>

<p>
and the last equality is 
</p>

<div class="LaTeX">
\begin{equation}
\begin{split}
    \mathbf{J}^{mn}\mathbf{A} = \mathbf{Q}
= \begin{bmatrix}
    \vdots \\ 
    -\mathbf{q}_p^T-
    \\ \vdots
  \end{bmatrix}
\quad
\text{where} \ \mathbf{q}_p^T = 
\left\{\begin{matrix}
[A_{n1},A_{n2},...] & \text{,if} \ p = m \\
\mathbf{0}^T & \text{,if} \ p \neq m
\end{matrix}\right.
\end{split}
\end{equation}

</div>

<p>
Such that
</p>

<div class="LaTeX">
\begin{equation}
\begin{split}
(\mathbf{J}^{mn}\mathbf{A})_{ij}
= Q_{ij}
= \left\{\begin{matrix}
   A_{nj}& \quad \text{,if} \ m=i\\ 
   0 & \quad \text{,if} \ m \neq i
  \end{matrix}\right.
\end{split}
\end{equation}

</div>
</div>
</div>
</div>



<div id="outline-container-org3c69352" class="outline-2">
<h2 id="org3c69352"><span class="section-number-2">7</span> Eq75</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org41d3019" class="outline-3">
<h3 id="org41d3019"><span class="section-number-3">7.1</span> problem</h3>
<div class="outline-text-3" id="text-7-1">
<div class="LaTeX">
\begin{equation}
\begin{split}
  \frac{\partial }{\partial X_{mn}} \big((\mathbf{X}^T\mathbf{A})_{ij}\big)
  = \delta_{in}(\mathbf{A})_{mj}
  = (\mathbf{J}^{nm}\mathbf{A})_{ij}
\end{split}
\end{equation}

</div>
</div>
</div>

<div id="outline-container-org5b41ecf" class="outline-3">
<h3 id="org5b41ecf"><span class="section-number-3">7.2</span> derivation</h3>
<div class="outline-text-3" id="text-7-2">
<p>
Simply reverse the notation m and n in Eq74.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: Sat Nov 28 21:32:25 2020 Fri Nov 27 22:15:33 2020</p>
<p class="author">Author: Wan-Duo Kurt Ma Wan-Duo Kurt Ma</p>
<p class="date">Created: 2020-11-29 Sun 00:06</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
